
&После("ОбработчикКоманды")
Процедура _ДемоРасширениеОбработчикКоманды(ФормаОтчета, Команда, Результат)
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет._ДемоРасширениеОстаткиТоваров"
	   И Команда.Имя = "_ДемоКоманда" Тогда
		
		ТабличныйДокумент = ФормаОтчета.ОтчетТабличныйДокумент;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Редактирование таблицы сформированного отчета ""%1""'"),
			ФормаОтчета.Заголовок);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИмяДокумента",      Заголовок);
		ПараметрыОткрытия.Вставить("ТабличныйДокумент", ТабличныйДокумент);
		ПараметрыОткрытия.Вставить("Редактирование",    Истина);
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры
